#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.dev.data.archive_file.http_function_source["describe"]: Reading...
module.dev.data.archive_file.http_function_source["go"]: Reading...
module.dev.data.archive_file.http_function_source["js"]: Reading...
module.dev.data.archive_file.pubsub_function_source["updateUserRole"]: Reading...
module.dev.data.archive_file.http_function_source["merch"]: Reading...
module.dev.data.archive_file.http_function_source["go"]: Read complete after 0s [id=2b43ceea3bef18a296541bf1613fd465c8d8fa04]
module.dev.data.archive_file.http_function_source["video"]: Reading...
module.dev.data.archive_file.http_function_source["hello"]: Reading...
module.dev.data.archive_file.http_function_source["merch"]: Read complete after 0s [id=df6f67767fcc0a096ae3706ad16d46535b3c7411]
module.dev.data.archive_file.http_function_source["level"]: Reading...
module.dev.data.archive_file.http_function_source["exam"]: Reading...
module.dev.data.archive_file.http_function_source["describe"]: Read complete after 0s [id=8149d3888af4d77844b83253c94a05cff143ff3f]
module.dev.data.archive_file.http_function_source["level"]: Read complete after 0s [id=3fcc615182fd8bdcd4ab92bb62515ef6b58a0ea6]
module.dev.data.archive_file.http_function_source["hello"]: Read complete after 0s [id=d3aff51c68f98c729867e28f35be543c27184d8e]
module.dev.data.archive_file.http_function_source["js"]: Read complete after 0s [id=358d1a99ccf5ba2b4581cb504eb5c5b38aadc2e7]
module.dev.data.archive_file.pubsub_function_source["updateUserRole"]: Read complete after 0s [id=93ff48c45ffeafd96931e0b86e287b1336eeeeda]
module.dev.data.archive_file.http_function_source["video"]: Read complete after 0s [id=f596deb8463554d5744679eeb2214e4569389e90]
module.dev.data.archive_file.http_function_source["java"]: Reading...
module.dev.data.archive_file.http_function_source["exam"]: Read complete after 0s [id=30c849366260739135b1ab7c97af1aa6eca20c1c]
module.dev.data.archive_file.http_function_source["http"]: Reading...
module.dev.data.archive_file.http_function_source["ban"]: Reading...
module.dev.data.archive_file.http_function_source["http"]: Read complete after 0s [id=d1489db2bc3edebb74b3d9f87e67a74396744a41]
module.dev.data.archive_file.http_function_source["warn"]: Reading...
module.dev.data.archive_file.http_function_source["java"]: Read complete after 0s [id=5c394ffff4f20dea8bc47029905259fa732a6a85]
module.dev.data.archive_file.http_function_source["gif"]: Reading...
module.dev.data.archive_file.http_function_source["froge"]: Reading...
module.dev.data.archive_file.http_function_source["leaderboard"]: Reading...
module.dev.data.archive_file.http_function_source["listwarn"]: Reading...
module.dev.data.archive_file.http_function_source["help"]: Reading...
module.dev.data.archive_file.http_function_source["answer"]: Reading...
module.dev.data.archive_file.http_function_source["ban"]: Read complete after 0s [id=c50aab648aa613c99544b8ad8b7e19361c838e61]
module.dev.data.archive_file.http_function_source["froge"]: Read complete after 0s [id=98990a9f59ec6a8711e7f90924fb0ce1e4b483ad]
module.dev.data.archive_file.http_function_source["leaderboard"]: Read complete after 0s [id=d276adec74a5ac23773986b167399557ae58f455]
module.dev.data.archive_file.http_function_source["warn"]: Read complete after 0s [id=434c27bb787d0a0b6c1df8b496ba9632d8e36106]
module.dev.data.archive_file.http_function_source["gif"]: Read complete after 0s [id=531b9967286445e03ddd548761fd5ab6011a40b8]
module.dev.data.archive_file.pubsub_function_source["cloudErrorLog"]: Reading...
module.dev.data.archive_file.http_function_source["answer"]: Read complete after 0s [id=8990ff7d100ccf1a9eefa60e2fed3d07432d19e1]
module.dev.data.archive_file.http_function_source["help"]: Read complete after 0s [id=e4f9818109e6d3c6fb840ab00b90c99a6637c51a]
module.dev.data.archive_file.pubsub_function_source["stm"]: Reading...
module.dev.data.archive_file.http_function_source["listwarn"]: Read complete after 0s [id=f3c8398baba099038bc9ab7912479168c7c09a6a]
module.dev.data.archive_file.pubsub_function_source["frogeOfTheDay"]: Reading...
module.dev.data.archive_file.pubsub_function_source["exp"]: Reading...
module.dev.data.archive_file.pubsub_function_source["cloudDeploymentLog"]: Reading...
module.dev.data.archive_file.pubsub_function_source["cloudErrorLog"]: Read complete after 0s [id=dcf87a1e3f4a3bd372e0d8d8561a7869fe761a76]
module.dev.data.archive_file.pubsub_function_source["generateWelcomeImage"]: Reading...
module.dev.data.archive_file.pubsub_function_source["privateMessage"]: Reading...
module.dev.data.archive_file.pubsub_function_source["channelMessage"]: Reading...
module.dev.data.archive_file.pubsub_function_source["stm"]: Read complete after 0s [id=17ed2875479f777232a2d7541cfe4ed32df868c9]
module.dev.data.archive_file.pubsub_function_source["generateWelcomeImage"]: Read complete after 0s [id=0670e2955e9f86836446bb766bcd64a84f94db45]
module.dev.data.archive_file.pubsub_function_source["exp"]: Read complete after 0s [id=bf9b6bc5ac8335409b2bfb2fbb9be0eb0e116f09]
module.dev.data.archive_file.pubsub_function_source["cloudDeploymentLog"]: Read complete after 0s [id=f5e0c278783c73ab95d630022ac487fe5e220188]
module.dev.data.archive_file.pubsub_function_source["channelMessage"]: Read complete after 0s [id=31b3d9977309e0c93af950be7988130ce56772d2]
module.dev.data.archive_file.pubsub_function_source["privateMessage"]: Read complete after 0s [id=491bdf46456cc08936aed69ba45234d092cfd96b]
module.dev.google_pubsub_topic.pubsub_topic["cloud_function_crud_log"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_cloud_function_crud_log]
module.dev.google_storage_bucket.function_bucket: Refreshing state... [id=archy-f06ed-function-dev]
module.dev.google_logging_project_sink.cloud_function_crud_sing: Refreshing state... [id=projects/archy-f06ed/sinks/archy-cloud-function-crud-dev]
module.dev.google_secret_manager_secret.secret-basic["STM_API_KEY"]: Refreshing state... [id=projects/archy-f06ed/secrets/STM_API_KEY]
module.dev.google_logging_project_sink.cloud_function_error_sink: Refreshing state... [id=projects/archy-f06ed/sinks/archy-cloud-function-error-dev]
module.dev.google_secret_manager_secret.secret-basic["TENOR_API_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/TENOR_API_TOKEN]
module.dev.google_secret_manager_secret.secret-basic["YOUTUBE_API_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/YOUTUBE_API_TOKEN]
module.dev.google_secret_manager_secret.secret-basic["DISCORD_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/DISCORD_TOKEN]
module.dev.google_compute_instance.default: Refreshing state... [id=projects/archy-f06ed/zones/us-central1-a/instances/e2-micro-archy]
module.dev.data.archive_file.pubsub_function_source["frogeOfTheDay"]: Read complete after 1s [id=50fb4cd5139da10cc03f8fd0392efd82a5545c84]
module.dev.google_storage_bucket.froge: Refreshing state... [id=froge-public-bucket-dev]
module.dev.google_pubsub_topic.pubsub_topic["stm_status"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_stm_status]
module.dev.google_pubsub_topic.pubsub_topic["cloud_function_error_log"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_cloud_function_error_log]
module.dev.google_pubsub_topic.pubsub_topic["exp_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_exp_discord]
module.dev.google_pubsub_topic.pubsub_topic["channel_message_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_channel_message_discord]
module.dev.google_pubsub_topic.pubsub_topic["froge_of_the_day"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_froge_of_the_day]
module.dev.google_pubsub_topic.pubsub_topic["generate_welcome_image"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_generate_welcome_image]
module.dev.google_pubsub_topic.pubsub_topic["private_message_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_private_message_discord]
module.dev.google_pubsub_topic.pubsub_topic["update_user_role"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_update_user_role]
module.dev.google_storage_bucket_object.pubsub_function_zip["updateUserRole"]: Refreshing state... [id=archy-f06ed-function-dev-src-93ff48c45ffeafd96931e0b86e287b1336eeeeda.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["cloudErrorLog"]: Refreshing state... [id=archy-f06ed-function-dev-src-dcf87a1e3f4a3bd372e0d8d8561a7869fe761a76.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["frogeOfTheDay"]: Refreshing state... [id=archy-f06ed-function-dev-src-50fb4cd5139da10cc03f8fd0392efd82a5545c84.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["exp"]: Refreshing state... [id=archy-f06ed-function-dev-src-bf9b6bc5ac8335409b2bfb2fbb9be0eb0e116f09.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["privateMessage"]: Refreshing state... [id=archy-f06ed-function-dev-src-491bdf46456cc08936aed69ba45234d092cfd96b.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["cloudDeploymentLog"]: Refreshing state... [id=archy-f06ed-function-dev-src-8da3aafdbfe4202d58039fc1a290c47cb731ff50.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["stm"]: Refreshing state... [id=archy-f06ed-function-dev-src-17ed2875479f777232a2d7541cfe4ed32df868c9.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["generateWelcomeImage"]: Refreshing state... [id=archy-f06ed-function-dev-src-0670e2955e9f86836446bb766bcd64a84f94db45.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["channelMessage"]: Refreshing state... [id=archy-f06ed-function-dev-src-31b3d9977309e0c93af950be7988130ce56772d2.zip]
module.dev.google_storage_bucket_object.http_function_zip["ban"]: Refreshing state... [id=archy-f06ed-function-dev-src-c50aab648aa613c99544b8ad8b7e19361c838e61.zip]
module.dev.google_storage_bucket_object.http_function_zip["describe"]: Refreshing state... [id=archy-f06ed-function-dev-src-8149d3888af4d77844b83253c94a05cff143ff3f.zip]
module.dev.google_storage_bucket_object.http_function_zip["merch"]: Refreshing state... [id=archy-f06ed-function-dev-src-df6f67767fcc0a096ae3706ad16d46535b3c7411.zip]
module.dev.google_storage_bucket_object.http_function_zip["gif"]: Refreshing state... [id=archy-f06ed-function-dev-src-531b9967286445e03ddd548761fd5ab6011a40b8.zip]
module.dev.google_storage_bucket_object.http_function_zip["level"]: Refreshing state... [id=archy-f06ed-function-dev-src-3fcc615182fd8bdcd4ab92bb62515ef6b58a0ea6.zip]
module.dev.google_storage_bucket_object.http_function_zip["js"]: Refreshing state... [id=archy-f06ed-function-dev-src-358d1a99ccf5ba2b4581cb504eb5c5b38aadc2e7.zip]
module.dev.google_storage_bucket_object.http_function_zip["answer"]: Refreshing state... [id=archy-f06ed-function-dev-src-8990ff7d100ccf1a9eefa60e2fed3d07432d19e1.zip]
module.dev.google_storage_bucket_object.http_function_zip["hello"]: Refreshing state... [id=archy-f06ed-function-dev-src-d3aff51c68f98c729867e28f35be543c27184d8e.zip]
module.dev.google_storage_bucket_object.http_function_zip["warn"]: Refreshing state... [id=archy-f06ed-function-dev-src-9ecf12793a27920e1304597a230d826fe1a65dd9.zip]
module.dev.google_storage_bucket_object.http_function_zip["go"]: Refreshing state... [id=archy-f06ed-function-dev-src-2b43ceea3bef18a296541bf1613fd465c8d8fa04.zip]
module.dev.google_storage_bucket_object.http_function_zip["exam"]: Refreshing state... [id=archy-f06ed-function-dev-src-30c849366260739135b1ab7c97af1aa6eca20c1c.zip]
module.dev.google_storage_bucket_object.http_function_zip["java"]: Refreshing state... [id=archy-f06ed-function-dev-src-5c394ffff4f20dea8bc47029905259fa732a6a85.zip]
module.dev.google_storage_bucket_object.http_function_zip["video"]: Refreshing state... [id=archy-f06ed-function-dev-src-f596deb8463554d5744679eeb2214e4569389e90.zip]
module.dev.google_storage_bucket_object.http_function_zip["leaderboard"]: Refreshing state... [id=archy-f06ed-function-dev-src-d276adec74a5ac23773986b167399557ae58f455.zip]
module.dev.google_storage_bucket_object.http_function_zip["froge"]: Refreshing state... [id=archy-f06ed-function-dev-src-98990a9f59ec6a8711e7f90924fb0ce1e4b483ad.zip]
module.dev.google_storage_bucket_object.http_function_zip["http"]: Refreshing state... [id=archy-f06ed-function-dev-src-d1489db2bc3edebb74b3d9f87e67a74396744a41.zip]
module.dev.google_storage_bucket_object.http_function_zip["help"]: Refreshing state... [id=archy-f06ed-function-dev-src-e4f9818109e6d3c6fb840ab00b90c99a6637c51a.zip]
module.dev.google_storage_bucket_access_control.public_rule: Refreshing state... [id=froge-public-bucket-dev/allUsers]
module.dev.google_cloudfunctions_function.pubsub_function["privateMessage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_privateMessage]
module.dev.google_cloudfunctions_function.pubsub_function["generateWelcomeImage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_generateWelcomeImage]
module.dev.google_storage_bucket_object.http_function_zip["listwarn"]: Refreshing state... [id=archy-f06ed-function-dev-src-c76e2b4091666135120f396d7a9941b10dfccdd3.zip]
module.dev.google_cloudfunctions_function.pubsub_function["channelMessage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_channelMessage]
module.dev.google_cloudfunctions_function.pubsub_function["updateUserRole"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_updateUserRole]
module.dev.google_cloudfunctions_function.pubsub_function["cloudDeploymentLog"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_cloudDeploymentLog]
module.dev.google_cloudfunctions_function.pubsub_function["frogeOfTheDay"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_frogeOfTheDay]
module.dev.google_cloudfunctions_function.pubsub_function["cloudErrorLog"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_cloudErrorLog]
module.dev.google_cloudfunctions_function.pubsub_function["exp"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_exp]
module.dev.google_cloudfunctions_function.pubsub_function["stm"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_stm]
module.dev.google_cloudfunctions_function.http_function["help"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_help]
module.dev.google_cloudfunctions_function.http_function["ban"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_ban]
module.dev.google_cloudfunctions_function.http_function["merch"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_merch]
module.dev.google_cloudfunctions_function.http_function["leaderboard"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_leaderboard]
module.dev.google_cloudfunctions_function.http_function["java"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_java]
module.dev.google_cloudfunctions_function.http_function["js"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_js]
module.dev.google_cloudfunctions_function.http_function["describe"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_describe]
module.dev.google_cloudfunctions_function.http_function["gif"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_gif]
module.dev.google_cloudfunctions_function.http_function["listwarn"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_listwarn]
module.dev.google_cloudfunctions_function.http_function["froge"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_froge]
module.dev.google_cloudfunctions_function.http_function["exam"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_exam]
module.dev.google_cloudfunctions_function.http_function["warn"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_warn]
module.dev.google_cloudfunctions_function.http_function["go"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_go]
module.dev.google_cloudfunctions_function.http_function["http"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_http]
module.dev.google_cloudfunctions_function.http_function["answer"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_answer]
module.dev.google_cloudfunctions_function.http_function["level"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_level]
module.dev.google_cloudfunctions_function.http_function["hello"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_hello]
module.dev.google_cloudfunctions_function.http_function["video"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_video]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.google_cloudfunctions_function.http_function["listwarn"] will be updated in-place
  ~ resource "google_cloudfunctions_function" "http_function" {
        id                           = "projects/archy-f06ed/locations/us-central1/functions/dev_listwarn"
        name                         = "dev_listwarn"
      ~ source_archive_object        = "src-c76e2b4091666135120f396d7a9941b10dfccdd3.zip" -> "src-f3c8398baba099038bc9ab7912479168c7c09a6a.zip"
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dev.google_cloudfunctions_function.http_function["warn"] will be updated in-place
  ~ resource "google_cloudfunctions_function" "http_function" {
        id                           = "projects/archy-f06ed/locations/us-central1/functions/dev_warn"
        name                         = "dev_warn"
      ~ source_archive_object        = "src-9ecf12793a27920e1304597a230d826fe1a65dd9.zip" -> "src-434c27bb787d0a0b6c1df8b496ba9632d8e36106.zip"
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dev.google_cloudfunctions_function.pubsub_function["cloudDeploymentLog"] will be updated in-place
  ~ resource "google_cloudfunctions_function" "pubsub_function" {
        id                    = "projects/archy-f06ed/locations/us-central1/functions/dev_cloudDeploymentLog"
        name                  = "dev_cloudDeploymentLog"
      ~ source_archive_object = "src-8da3aafdbfe4202d58039fc1a290c47cb731ff50.zip" -> "src-f5e0c278783c73ab95d630022ac487fe5e220188.zip"
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.dev.google_storage_bucket_object.http_function_zip["listwarn"] must be replaced
-/+ resource "google_storage_bucket_object" "http_function_zip" {
      ~ crc32c           = "tS9mtw==" -> (known after apply)
      ~ detect_md5hash   = "u19WBTyYw7Td2acG3qtm9g==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "archy-f06ed-function-dev-src-c76e2b4091666135120f396d7a9941b10dfccdd3.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "u19WBTyYw7Td2acG3qtm9g==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-dev/o/src-c76e2b4091666135120f396d7a9941b10dfccdd3.zip?generation=1680617637001991&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "src-c76e2b4091666135120f396d7a9941b10dfccdd3.zip" -> "src-f3c8398baba099038bc9ab7912479168c7c09a6a.zip" # forces replacement
      ~ output_name      = "src-c76e2b4091666135120f396d7a9941b10dfccdd3.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-dev/o/src-c76e2b4091666135120f396d7a9941b10dfccdd3.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.http_function_zip["warn"] must be replaced
-/+ resource "google_storage_bucket_object" "http_function_zip" {
      ~ crc32c           = "FRTb3A==" -> (known after apply)
      ~ detect_md5hash   = "bUcVMC/d6T+A77NqWMH7Wg==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "archy-f06ed-function-dev-src-9ecf12793a27920e1304597a230d826fe1a65dd9.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "bUcVMC/d6T+A77NqWMH7Wg==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-dev/o/src-9ecf12793a27920e1304597a230d826fe1a65dd9.zip?generation=1680617637013570&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "src-9ecf12793a27920e1304597a230d826fe1a65dd9.zip" -> "src-434c27bb787d0a0b6c1df8b496ba9632d8e36106.zip" # forces replacement
      ~ output_name      = "src-9ecf12793a27920e1304597a230d826fe1a65dd9.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-dev/o/src-9ecf12793a27920e1304597a230d826fe1a65dd9.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.pubsub_function_zip["cloudDeploymentLog"] must be replaced
-/+ resource "google_storage_bucket_object" "pubsub_function_zip" {
      ~ crc32c           = "z9NYuQ==" -> (known after apply)
      ~ detect_md5hash   = "QsjbFh1qqCuYaU9wGYIrtw==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "archy-f06ed-function-dev-src-8da3aafdbfe4202d58039fc1a290c47cb731ff50.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "QsjbFh1qqCuYaU9wGYIrtw==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-dev/o/src-8da3aafdbfe4202d58039fc1a290c47cb731ff50.zip?generation=1680631751801071&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "src-8da3aafdbfe4202d58039fc1a290c47cb731ff50.zip" -> "src-f5e0c278783c73ab95d630022ac487fe5e220188.zip" # forces replacement
      ~ output_name      = "src-8da3aafdbfe4202d58039fc1a290c47cb731ff50.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-dev/o/src-8da3aafdbfe4202d58039fc1a290c47cb731ff50.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ArmandBriere, Action: `pull_request`, Workflow: `Terraform plan dev`*